src/org-files/guia-desarrollo-web/testing.org
#+BEGIN_COMMENT
Repositorio donde trabajo
https://github.com/neverkas/manu-testing

agregalo como submodulo en este git quizas?
o hace un listado? pensalo

*Pendiente
Links o info desde terminal con nvim
#+END_COMMENT
** Python tutoriales
1. https://pythonexamples.org/python-typeerror-method-takes-0-positional-arguments-but-1-was-given/
** Unitest con Python y Selenium
1. https://www.techbeamers.com/selenium-python-test-suite-unittest/
** Panda
Pandas parece ser una biblioteca para manejar datos de excels
y se puede manipular con c칩digo
*** Referencias
1. https://pythonexamples.org/pandas-dataframe-add-column/
2. https://www.youtube.com/watch?v=8ASjvOIyyl8

* Testing con Selenium
*** Instalaci칩n

    #+BEGIN_SRC sh
      # 1. lo instalamos selenium
      sudo pacman -S python-selenium

      # 2. instalamos el webdriver para firefox
      sudo pacman -S geckodriver

      # se puede instalar con pip de python
    #+END_SRC

*** Un hello world 
    
    #+BEGIN_SRC python
      from selenium import webdriver
      # para usar el sleep
      import time
      # para usar teclas como enter
      from selenium.webdriver.common.keys import Keys
      # elegimos que navegador usaremos
      driver = webdriver.Firefox()
      # le asignamos una direcci칩n donde ir
      driver.get('http://google.com')
      # aguardamos 2 segundos antes de seguir
      time.sleep(2)

      # seleccinamos el campo de texto usual de busqueda de google
      busqueda_box = driver.find_element_by_name('q')
      # hacemos que escriba un texto
      busqueda_box.send_keys('mafalda san telmo')
      # y que simule presionar la tecla enter
      busqueda_box.send_keys(Keys.ENTER)
      # hacemos que espere un rato
      time.sleep(2)
      # se cerrar치 el navegador
      driver.quit()

    #+END_SRC

** Referencias 
   - [[https://selenium-python.readthedocs.io/][Selenium With Python (Muy completo)]] 
   + https://enmilocalfunciona.io/automatizacion-de-pruebas-con-selenium-y-python/
   + https://linuxhint.com/browser_automation_selenium_python/
   + https://discover.manjaro.org/packages/python-selenium
   + https://github.com/mozilla/geckodriver/releases

   - https://www.geeksforgeeks.org/get_attribute-element-method-selenium-python/
   - https://selenium-python.readthedocs.io/api.html
   + [[https://stackoverflow.com/questions/1896918/running-unittest-with-typical-test-directory-structure/22244465][Unitest python selenium]]
   + [[https://stackoverflow.com/questions/36202689/selenium-webdriver-get-text-from-input-field?rq=1][Selenium - get_attribute]]
   + [[https://stackoverflow.com/questions/1629053/typing-enter-return-key-using-python-and-selenium][Selenium - Keys Enter]]

   + [[https://www.youtube.com/watch?v=nDqgZVCbnmI][#1 Spacemacs - Python]]
   + [[https://www.youtube.com/watch?v=r-BHx7VNX5s][#2 Spacemacs - Python]]
   + [[https://www.youtube.com/watch?v=U6sp5dJWFAM][#3 Spacemacs - python, pyenv, pyls, flake8]]

** Issues
   - http://allselenium.info/file-downloads-python-selenium-webdriver/
   - https://stackoverflow.com/questions/10629815/how-to-switch-to-new-window-in-selenium-for-python
   - https://stackoverflow.com/questions/915338/how-can-i-find-the-link-url-by-link-text-with-xpath
   - https://stackoverflow.com/questions/28431765/open-web-in-new-tab-selenium-python
   - https://stackoverflow.com/questions/22515012/python-selenium-how-can-i-delete-an-element
   - https://stackoverflow.com/questions/24852709/how-do-i-automatically-download-files-from-a-pop-up-dialog-using-selenium-python?rq=1
* Web Scrapping
** Referencias
   - https://www.youtube.com/watch?v=0O1SyTh8Zxo
* XPATH
** Referencias
   - http://xpather.com/
   - https://devhints.io/xpath

