dist/testing.html
<!--?xml version="1.0" encoding="utf-8"?--><!DOCTYPE html><html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en"><head>
<!-- 2021-03-31 mié 00:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>‎</title>
<meta name="generator" content="Org mode">
<meta name="author" content="jelou">
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org617477f">0.1. Python tutoriales</a></li>
<li><a href="#orgd374a89">0.2. Unitest con Python y Selenium</a></li>
<li><a href="#orga16fb0b">0.3. Panda</a>
<ul>
<li><a href="#orga3f7835">0.3.1. Referencias</a></li>
</ul>
</li>
</ul>

<li><a href="#org9ba833d">1. Testing con Selenium</a>
<ul>
<li>
<ul>
<li><a href="#org871f9d2">1.0.1. Instalación</a></li>
<li><a href="#org5d96063">1.0.2. Un hello world</a></li>
</ul>
</li>
<li><a href="#org64ea4fd">1.1. Referencias</a></li>
<li><a href="#orgef04b84">1.2. Issues</a></li>
</ul>
</li>
<li><a href="#org0f022cc">2. Web Scrapping</a>
<ul>
<li><a href="#org4cb83ee">2.1. Referencias</a></li>
</ul>
</li>
<li><a href="#org5720131">3. XPATH</a>
<ul>
<li><a href="#org7e886cb">3.1. Referencias</a></li>
</ul>
</li></div>
</div>
<p>
Repositorio donde trabajo
<a href="https://github.com/neverkas/manu-testing">https://github.com/neverkas/manu-testing</a>
</p>

<p>
agregalo como submodulo en este git quizas?
o hace un listado? pensalo
</p>

<p>
*Pendiente
Links o info desde terminal con nvim
</p>
<div id="outline-container-org617477f" class="outline-3">
<h3 id="org617477f"><span class="section-number-3">0.1</span> Python tutoriales</h3>
<div class="outline-text-3" id="text-0-1">
<ol class="org-ol">
<li><a href="https://pythonexamples.org/python-typeerror-method-takes-0-positional-arguments-but-1-was-given/">https://pythonexamples.org/python-typeerror-method-takes-0-positional-arguments-but-1-was-given/</a></li>
</ol>
</div>
</div>
<div id="outline-container-orgd374a89" class="outline-3">
<h3 id="orgd374a89"><span class="section-number-3">0.2</span> Unitest con Python y Selenium</h3>
<div class="outline-text-3" id="text-0-2">
<ol class="org-ol">
<li><a href="https://www.techbeamers.com/selenium-python-test-suite-unittest/">https://www.techbeamers.com/selenium-python-test-suite-unittest/</a></li>
</ol>
</div>
</div>
<div id="outline-container-orga16fb0b" class="outline-3">
<h3 id="orga16fb0b"><span class="section-number-3">0.3</span> Panda</h3>
<div class="outline-text-3" id="text-0-3">
<p>
Pandas parece ser una biblioteca para manejar datos de excels
y se puede manipular con código
</p>
</div>
<div id="outline-container-orga3f7835" class="outline-4">
<h4 id="orga3f7835"><span class="section-number-4">0.3.1</span> Referencias</h4>
<div class="outline-text-4" id="text-0-3-1">
<ol class="org-ol">
<li><a href="https://pythonexamples.org/pandas-dataframe-add-column/">https://pythonexamples.org/pandas-dataframe-add-column/</a></li>
<li><a href="https://www.youtube.com/watch?v=8ASjvOIyyl8">https://www.youtube.com/watch?v=8ASjvOIyyl8</a></li>
</ol>
</div>
</div>
</div>

<div id="outline-container-org9ba833d" class="outline-2">
<h2 id="org9ba833d"><span class="section-number-2">1</span> Testing con Selenium</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org871f9d2" class="outline-4">
<h4 id="org871f9d2"><span class="section-number-4">1.0.1</span> Instalación</h4>
<div class="outline-text-4" id="text-1-0-1">
<div class="org-src-container">
<pre class="src src-sh"># 1. lo instalamos selenium
sudo pacman -S python-selenium

# 2. instalamos el webdriver para firefox
sudo pacman -S geckodriver

# se puede instalar con pip de python
</pre>
</div>
</div>
</div>

<div id="outline-container-org5d96063" class="outline-4">
<h4 id="org5d96063"><span class="section-number-4">1.0.2</span> Un hello world</h4>
<div class="outline-text-4" id="text-1-0-2">
<div class="org-src-container">
<pre class="src src-python">from selenium import webdriver
# para usar el sleep
import time
# para usar teclas como enter
from selenium.webdriver.common.keys import Keys
# elegimos que navegador usaremos
driver = webdriver.Firefox()
# le asignamos una dirección donde ir
driver.get('http://google.com')
# aguardamos 2 segundos antes de seguir
time.sleep(2)

# seleccinamos el campo de texto usual de busqueda de google
busqueda_box = driver.find_element_by_name('q')
# hacemos que escriba un texto
busqueda_box.send_keys('mafalda san telmo')
# y que simule presionar la tecla enter
busqueda_box.send_keys(Keys.ENTER)
# hacemos que espere un rato
time.sleep(2)
# se cerrará el navegador
driver.quit()

</pre>
</div>
</div>
</div>

<div id="outline-container-org64ea4fd" class="outline-3">
<h3 id="org64ea4fd"><span class="section-number-3">1.1</span> Referencias</h3>
<div class="outline-text-3" id="text-1-1">
<ul class="org-ul">
<li><a href="https://selenium-python.readthedocs.io/">Selenium With Python (Muy completo)</a></li>
<li><a href="https://enmilocalfunciona.io/automatizacion-de-pruebas-con-selenium-y-python/">https://enmilocalfunciona.io/automatizacion-de-pruebas-con-selenium-y-python/</a></li>
<li><a href="https://linuxhint.com/browser_automation_selenium_python/">https://linuxhint.com/browser_automation_selenium_python/</a></li>
<li><a href="https://discover.manjaro.org/packages/python-selenium">https://discover.manjaro.org/packages/python-selenium</a></li>
<li><a href="https://github.com/mozilla/geckodriver/releases">https://github.com/mozilla/geckodriver/releases</a></li>

<li><a href="https://www.geeksforgeeks.org/get_attribute-element-method-selenium-python/">https://www.geeksforgeeks.org/get_attribute-element-method-selenium-python/</a></li>
<li><a href="https://selenium-python.readthedocs.io/api.html">https://selenium-python.readthedocs.io/api.html</a></li>
<li><a href="https://stackoverflow.com/questions/1896918/running-unittest-with-typical-test-directory-structure/22244465">Unitest python selenium</a></li>
<li><a href="https://stackoverflow.com/questions/36202689/selenium-webdriver-get-text-from-input-field?rq=1">Selenium - get<sub>attribute</sub></a></li>
<li><a href="https://stackoverflow.com/questions/1629053/typing-enter-return-key-using-python-and-selenium">Selenium - Keys Enter</a></li>

<li><a href="https://www.youtube.com/watch?v=nDqgZVCbnmI">#1 Spacemacs - Python</a></li>
<li><a href="https://www.youtube.com/watch?v=r-BHx7VNX5s">#2 Spacemacs - Python</a></li>
<li><a href="https://www.youtube.com/watch?v=U6sp5dJWFAM">#3 Spacemacs - python, pyenv, pyls, flake8</a></li>
</ul>
</div>
</div>

<div id="outline-container-orgef04b84" class="outline-3">
<h3 id="orgef04b84"><span class="section-number-3">1.2</span> Issues</h3>
<div class="outline-text-3" id="text-1-2">
<ul class="org-ul">
<li><a href="http://allselenium.info/file-downloads-python-selenium-webdriver/">http://allselenium.info/file-downloads-python-selenium-webdriver/</a></li>
<li><a href="https://stackoverflow.com/questions/10629815/how-to-switch-to-new-window-in-selenium-for-python">https://stackoverflow.com/questions/10629815/how-to-switch-to-new-window-in-selenium-for-python</a></li>
<li><a href="https://stackoverflow.com/questions/915338/how-can-i-find-the-link-url-by-link-text-with-xpath">https://stackoverflow.com/questions/915338/how-can-i-find-the-link-url-by-link-text-with-xpath</a></li>
<li><a href="https://stackoverflow.com/questions/28431765/open-web-in-new-tab-selenium-python">https://stackoverflow.com/questions/28431765/open-web-in-new-tab-selenium-python</a></li>
<li><a href="https://stackoverflow.com/questions/22515012/python-selenium-how-can-i-delete-an-element">https://stackoverflow.com/questions/22515012/python-selenium-how-can-i-delete-an-element</a></li>
<li><a href="https://stackoverflow.com/questions/24852709/how-do-i-automatically-download-files-from-a-pop-up-dialog-using-selenium-python?rq=1">https://stackoverflow.com/questions/24852709/how-do-i-automatically-download-files-from-a-pop-up-dialog-using-selenium-python?rq=1</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org0f022cc" class="outline-2">
<h2 id="org0f022cc"><span class="section-number-2">2</span> Web Scrapping</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org4cb83ee" class="outline-3">
<h3 id="org4cb83ee"><span class="section-number-3">2.1</span> Referencias</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=0O1SyTh8Zxo">https://www.youtube.com/watch?v=0O1SyTh8Zxo</a></li>
</ul>
</div>
</div>
</div>
<div id="outline-container-org5720131" class="outline-2">
<h2 id="org5720131"><span class="section-number-2">3</span> XPATH</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org7e886cb" class="outline-3">
<h3 id="org7e886cb"><span class="section-number-3">3.1</span> Referencias</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li><a href="http://xpather.com/">http://xpather.com/</a></li>
<li><a href="https://devhints.io/xpath">https://devhints.io/xpath</a></li>
</ul>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: jelou</p>
<p class="date">Created: 2021-03-31 mié 00:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>


</body></html>